public class Main {
    public static void main(String[] args) {
        /**
         * ЗАДАНИЕ 1. Пользователь с клавиатуры вводит путь к файлу. После чего
         * содержимое файла отображается на экране.
         * ЗАДАНИЕ 2. Напиши программу в которой.:
         * 1. Создайте файл “1.txt” в корне проекта и запишите с помощью потока
         * вывода фразу “Миша ездит на Жигули, а Катя на Мерседес”. (Если пока
         * сложно, можно после создания файла записать фразу руками)
         * 2. Создайте в папке с проектом папку “Результат”.
         * 3. Создайте в папке Результат файл “2.txt”.
         * 4. Откройте два потока для ввода и вывода данных. Поток для ввода
         * читает информацию из файла “1.txt” массив байт.
         * 5. Преобразуйте массив байт в тип String, замените “Жигули” на “BMW”,
         * а “Мерседес” на “Рено”.
         * 6. Запишите результат п.4 в файл “2.txt”.
         * Готовое задание загрузи в эл. журнал.
         * Успехов!
         */
    }
}
